---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveLocked
source: html/6416f54e-679f-e184-6db6-ead0e068fcdd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveLocked Property

Can't move pinned element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveLocked { get; }
```